//*****************************************************************************
//
// テクスチャ処理 [Texture.cpp]
//
// Author : LIAO HANCHEN
//
//*****************************************************************************
#include "Texture.h"

//*****************************************************************************
//
// コンストラクタ
//
//*****************************************************************************
Texture::Texture(string path)
{
	this->mPath = path;
	this->mTex = nullptr;

	// テクスチャを読み込み
	loadingTexture();
}

//*****************************************************************************
//
// デストラクタ
//
//*****************************************************************************
Texture::~Texture()
{

}

//*****************************************************************************
//
// テクスチャを読み込み
//
//*****************************************************************************
HRESULT Texture::loadingTexture()
{
	LPDIRECT3DDEVICE9	D3dDevice = getDevice();

	// テクスチャを読み込み
	if (FAILED(D3DXCreateTextureFromFile(
		D3dDevice,
		mPath.data(),
		&mTex)))
	{
		cout << "[Error] Loading <Texture> " << mPath << " ... fail!" << endl;	// コンソールにメッセージを出す
		return E_FAIL;
	}

	return S_OK;
}