//*****************************************************************************
//
// ライト処理 [Light.h]
//
// Author : LIAO HANCHEN
//
//*****************************************************************************
#ifndef _LIGHT_H_
#define _LIGHT_H_

#include "..\Engine.h"
#include "..\DebugMessage.h"

//*****************************************************************************
//
// クラス宣言
//
//*****************************************************************************
class Light
{
private:

public:
	D3DLIGHT9			light;  // ここでは平行光源
	D3DXVECTOR3			pos;

	Light();	
	~Light();
};
#endif // !_LIGHT_H_
