//*****************************************************************************
//
// シーン処理 [Scene.cpp]
//
// Author : LIAO HANCHEN
//
//*****************************************************************************
#include "Scene.h"

using namespace std;

//*****************************************************************************
//
// コンストラクタ
//
//*****************************************************************************
Scene::Scene()
{	
	m_resourcesManager = new ResourcesManager;	// リソース
	m_message = new DebugMessage;

	// FbxSDk初期化
	m_fbxSdk = new FBX_SDK();
	m_fbxSdk->InitFbxSDK();
}

//*****************************************************************************
//
// デストラクタ
//
//*****************************************************************************
Scene::~Scene()
{
	// クラスポインタ
	// リソース
	RELEASE_CLASS_POINT(m_resourcesManager);
	RELEASE_CLASS_POINT(m_message);
	RELEASE_CLASS_POINT(m_fbxSdk);
}

//*****************************************************************************
//
// fbxSDkによって読み込んだデータを自分のSceneクラスに入れる
//
//*****************************************************************************
bool Scene::FromFbxSceneToScene()
{
	return true;
}