//*****************************************************************************
//
// コンソール処理 [Console.cpp]
//
// Author : LIAO HANCHEN
//
//*****************************************************************************
#include "Console.h"

//*****************************************************************************
//
// コンストラクタ
//
//*****************************************************************************
Console::Console()
{
	this->isConsoleRun = AllocConsole();	// コンソールを初期化
	SetConsoleTitle(_T("Debug Output"));	// コンソールのタイトルを設定する
	freopen("CONIN$", "r", stdin);	// コンソールにinput,outputを指定
	freopen("CONOUT$", "w", stdout);
	freopen("CONOUT$", "w", stderr);
}

//*****************************************************************************
//
// デストラクタ
//
//*****************************************************************************
Console::~Console()
{
	this->isConsoleRun = FreeConsole() & 1;
}

//*****************************************************************************
//
// コンソールからゲームウインドに戻る
//
//*****************************************************************************
HRESULT Console::SetConsoleBack(HWND hwnd, int cmd)
{

		return S_OK;
}

//*****************************************************************************
//
// ゲームのウィンドからコンソールに変更
//
//*****************************************************************************
HRESULT Console::SetConsoleFront(HWND hwnd)
{

	return S_OK;;
}