//*****************************************************************************
//
// グラフィクUI処理 [GUI.h]
//
// ImGuiを利用する
//
// Author : LIAO HANCHEN
//
//*****************************************************************************
#ifndef _GUI_H_
#define _GUI_H_

#include "Engine.h"

//*****************************************************************************
//
// クラス宣言
//
//*****************************************************************************
class GUI
{
private:

public:
	GUI(HINSTANCE hInstance, HWND hWnd);
	~GUI();

	void start();
	void update();
	void draw();
};

#endif // !_GUI_H_
