//*****************************************************************************
//
// ライト処理 [Light.h]
//
// Author : LIAO HANCHEN
//
//*****************************************************************************
#ifndef _LIGHT_H_
#define _LIGHT_H_

//*****************************************************************************
//
// クラス宣言
//
//*****************************************************************************
class Light
{
private:

public:
	float				attenuation;	// ライトの減衰値
	D3DXVECTOR3			pos;			// ライトの位置
	D3DXVECTOR4			ambient;		// 環境値
	D3DXVECTOR4			diffuse;		// 拡散反射値
	D3DXVECTOR4			specular;		// 鏡面反射値
	

	Light();	
	~Light();
};
#endif // !_LIGHT_H_
