//*****************************************************************************
//
// リソース管理 [Resources.cpp]
//
// Author : LIAO HANCHEN
//
//*****************************************************************************
#include "Resources.h"

//*****************************************************************************
//
// コンストラクタ
//
//*****************************************************************************
Resources::Resources()
{
	mD3DDevice = GetDevice();
}

//*****************************************************************************
//
// デストラクタ
//
//*****************************************************************************
Resources::~Resources()
{
	RELEASE_POINT(mD3DDevice);

	// delete Map(to do)
}

//*****************************************************************************
//
// Assimpでモデルを読み込み
//
//*****************************************************************************
void Resources::loadModel(string name, string path)
{
	mModels.insert({ name, new Model(path) }); // モデルを名前とデータをペアにする
}

//*****************************************************************************
//
// モデルを名前によってゲット
//
//*****************************************************************************
Model* Resources::GetModel(string name)
{
	if (mModels.find(name) != mModels.end())
	{
		return mModels[name];
	}

	cout << "[Error] " << name << " failed!" << endl;
	return nullptr;
}

//*****************************************************************************
//
// Assimpでテクスチャを読み込み
//
//*****************************************************************************
void Resources::LoadTexture(string name, string path)
{
	mTextures.insert({ name, new Texture(path) });	
}

//*****************************************************************************
//
// テクスチャを名前によって取得
//
//*****************************************************************************
Texture* Resources::GetTexture(string name)
{
	if (mTextures.find(name) != mTextures.end())
	{
		return mTextures[name];
	}
	
	cout << "[Error] " << name << " failed!" << endl;
	return nullptr;
}