//*****************************************************************************
//
// アニメーション処理 [Scene02.h]
//
// Author : LIAO HANCHEN
//
//*****************************************************************************
#ifndef _SCENE02_H_
#define _SCENE02_H_

#include "Scene.h"

#include "..\Engine\Model\Mesh.h"

//*****************************************************************************
//
// クラス宣言
//
//*****************************************************************************
class Scene02 : public Scene
{
private:

public:
	Scene02(void);
	~Scene02(void);

	void start(void);
};
#endif // !_SCENE02_H_

