//*****************************************************************************
//
// ライト処理 [Light.cpp]
//
// Author : リョウ　カンシン
//
//*****************************************************************************
#include "Light.h"

//*****************************************************************************
//
// コンストラクタ
//
//*****************************************************************************
Light::Light()
{

}

//*****************************************************************************
//
// デストラクタ
//
//*****************************************************************************
Light::~Light()
{

}

//*****************************************************************************
//
// 初期化
//
//*****************************************************************************
void Light::start()
{
	this->mCurrentLightType = this->mLightType;
}

//*****************************************************************************
//
// ImGuiでPointLightのデータを出す
//
//*****************************************************************************
void Light::drawImGui()
{
	ImGui::Text(u8"ポイントライト");
	float* v1[3] = { &this->mLightPos.x, &this->mLightPos.y, &this->mLightPos.z };
	ImGui::InputFloat3("pos", *v1);
	ImGui::Separator();

	ImGui::Text(u8"ポイントライト減衰パラメータ");
	ImGui::InputFloat("Constant", &this->mPointLight.constant);
	ImGui::InputFloat("Linear", &this->mPointLight.linear);
	ImGui::InputFloat("Quadratic", &this->mPointLight.quadratic);
}