//*****************************************************************************
//
// 変換処理 [Transform.cpp]
//
// Author : リョウ　カンシン
//
//*****************************************************************************
#include "MeshRender.h"

//*****************************************************************************
//
// コンストラクタ
//
//*****************************************************************************
MeshRender::MeshRender()
{

}

//*****************************************************************************
//
// デストラクタ
//
//*****************************************************************************
MeshRender::~MeshRender()
{

}

//*****************************************************************************
//
// 初期化
//
//*****************************************************************************
void MeshRender::start()
{
	// カメラ情報を取得
	Camera* camera = mMainCamera->getComponent<Camera>("camera");

	// カメラの行列をシェーダーに渡す
	mShader->mEffect->SetValue("viewMatrix", camera->mViewMatrix, sizeof(D3DXMATRIX));
	mShader->mEffect->SetValue("projectionMatrix", camera->mProjectionMatrix, sizeof(D3DXMATRIX));
}

//*****************************************************************************
//
// ドロー
//
//*****************************************************************************
void MeshRender::draw()
{
	mShader->mEffect->SetValue("worldMatrix", &this->wMatrix, sizeof(D3DXMATRIX));
	mModel->draw();
}
